#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag               = "621b8a22ec9502bb4308aa8ec187704d" -> "1bd1724bf762ecfb60875303c8ec435f"
        id                 = "lambdas/demo/add_investment_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag               = "5424093d114a1a5d256aaa1aa1c48221" -> "13b8b8e2eea203e9f6c9009ee67b4529"
        id                 = "lambdas/demo/add_scenario_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_tag_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_tag_function_object" {
      ~ etag               = "d37aa28fe10affd6597048d430422763" -> "9f0d7111ac9cd39b10e2cf1dfb0a7859"
        id                 = "lambdas/demo/add_tag_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag               = "95b1e1b805a9c699b72a3f96c1657769" -> "f48f2e0e9b28fa787f8057af13bc7fb3"
        id                 = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag               = "52ea4ad2bdb38ac270f2b9db27be43f3" -> "fda29b80b5b0f7a2b24ddb25ad860db4"
        id                 = "lambdas/demo/assign_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag               = "52a4ae73d7056dc89ba46ffd723eba0c" -> "be18d1675d331e4fcd95f08ebedef6c5"
        id                 = "lambdas/demo/authorize_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag               = "f60874f6fbc7fd96efdd174d3f58d8b8" -> "482c1e864ee9cab13c55b57572b8f27d"
        id                 = "lambdas/demo/change_company_publicly_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag               = "2696d37ef32054ea5dca9cf2839603ae" -> "e3bb3780b4ca6ec2c20ac8a551c333ec"
        id                 = "lambdas/demo/change_user_role_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag               = "f64866a7b0c8f36b07cd710b6e3ebd32" -> "5b7928c0000b7ccf40822e343630f741"
        id                 = "lambdas/demo/connect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag               = "19d33956a961cf121d92755cc1123df9" -> "99a4e3293a539b7bf9c02f386b3d594d"
        id                 = "lambdas/demo/delete_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag               = "c1eb43fac0e4d5c11835e7995bdc3328" -> "1d7886e0a85071ca3ed4dff82c388a28"
        id                 = "lambdas/demo/delete_scenarios_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_tags_function_object" {
      ~ etag               = "b4aa1bdc1adb4e38cfe1f8e3e7976cad" -> "8d64af43f59abca8e040007b10ff462d"
        id                 = "lambdas/demo/delete_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag               = "cdb566769a31d6a0e0fc54ee9a223245" -> "374430f590c94c0021fa20cfc5372f10"
        id                 = "lambdas/demo/disconnect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag               = "3182ffc9db3cb7f7879fca101d13f0b7" -> "e8a8bea7cf469ea3cb6ed5b09b28a33e"
        id                 = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag               = "b1a71d40862a9aa73be8e44bf8053702" -> "56db1bba3624881757bcb516f5a6c2b8"
        id                 = "lambdas/demo/edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag               = "1b901c5086720d3cda501ff3adda2787" -> "57c0ffaae0a4e929e00c393dfe3e40b5"
        id                 = "lambdas/demo/get_all_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag               = "a115b7d0744cb59e243d4fb76ea0d2ec" -> "2dba785142d47d8ee4c59d41418b8a89"
        id                 = "lambdas/demo/get_all_public_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_ranges_function_object" {
      ~ etag               = "0e63ad05f17c3fea424be61a0b65c102" -> "29ac9617f2387a6b83cc5d9f16e7029a"
        id                 = "lambdas/demo/get_all_ranges_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_tags_function_object" {
      ~ etag               = "dbb8b31252926908707ba281e89946af" -> "52c984daa5048cd5e246e812605362c3"
        id                 = "lambdas/demo/get_all_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag               = "44918046a528cf76bfd230b91c8571e2" -> "23e7f3b263922e73c775904a998d0511"
        id                 = "lambdas/demo/get_by_metric_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag               = "c2d7a0105e4edbc3397f1200ccd84160" -> "9402b095b24b41a87b91be1eae67b439"
        id                 = "lambdas/demo/get_company_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag               = "93930cd5d6ca05832af6b512a1245100" -> "1738a940ae14dbcdceeb205f81cb81ab"
        id                 = "lambdas/demo/get_company_investments_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag               = "e8ab3d2a8a7da8e551e02d2639547fe3" -> "cd47e668bf8c717a07f336e518afcb2c"
        id                 = "lambdas/demo/get_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag               = "c2c293382343b9396d79c31cb9808b75" -> "ea1c1cca0b5bdf4f73c3719910f7252d"
        id                 = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag               = "b705fd85cf6129aa5cf0b3a32cd4eb12" -> "31b4b648cc01fe8efd1c56a06399ca73"
        id                 = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag               = "5b91121117d40e14f8d4638f6e9eb349" -> "94f27c8faa5be74992a860135847c75d"
        id                 = "lambdas/demo/get_dynamic_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag               = "e38c7b45e6a6f4820b8c96ce3a3bc337" -> "1ba54026e14c12564a7a0fb7fcb1c5cb"
        id                 = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_date_report_function_object" {
      ~ etag               = "29243f5f5843e7091cee4ec4abe371b2" -> "eb522056a9a1b2d70806cdc7ff2551a0"
        id                 = "lambdas/demo/get_investment_date_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag               = "ecd8b269323e1254e1f63a66a751b0c1" -> "135edf16eceeb7d38a40e72376983d4f"
        id                 = "lambdas/demo/get_metric_types_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_ranges_by_metric_function_object will be created
  + resource "aws_s3_bucket_object" "get_ranges_by_metric_function_object" {
      + acl                    = "private"
      + bucket                 = "kpinetwork-backend"
      + bucket_key_enabled     = (known after apply)
      + content_type           = (known after apply)
      + etag                   = "804afefa6d5bb12d57f097409dfc2cb1"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "lambdas/demo/get_ranges_by_metric_handler.zip"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "buckets/../../dist/get_ranges_by_metric_handler.zip"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag               = "0b78c3de9821132b61332dadda7684c2" -> "eb2189a3e9053de1da5a47e7e5449c64"
        id                 = "lambdas/demo/get_roles_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_tags_by_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_tags_by_company_function_object" {
      ~ etag               = "f2adf0fe95a27f563b2d8a184b4bb783" -> "236d6ae6c7efdd54c398fa0525f6c05b"
        id                 = "lambdas/demo/get_tags_by_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag               = "41d203f4cf57735aecd25dbce21b4a54" -> "925eeb90773c722ad9b0c97dbe484d2a"
        id                 = "lambdas/demo/get_universe_overview_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag               = "4565ac8989d532d0caeb93af3bc65f98" -> "318aedda208ed3780bd85498b41d8e94"
        id                 = "lambdas/demo/get_user_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag               = "dd508c6953c3e341c43d365a680947f7" -> "54bc14bb5cb9d56aeb1edc3eefce2f4a"
        id                 = "lambdas/demo/get_users_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag               = "1ec55e77898b97bab33678f4eba44b3b" -> "27c5713e7f1961dd34c2847aba809228"
        id                 = "lambdas/demo/glue_trigger_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag               = "c1b037a09f95d7949a3bb715d99563d0" -> "0b5ff674c5d9e8d40e0fcc33ce2290ec"
        id                 = "layer/demo/layer_libraries.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag               = "02f8b9a079a2a071270c8423b3dea05a" -> "831f5b27a8c4443b96b43d23ae2f486a"
        id                 = "lambdas/demo/message.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag               = "516996bcd57de1bad7cf6726f2734256" -> "8013c86ccc4e884e958dc8f80df66506"
        id                 = "lambdas/demo/register.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag               = "e7a6869d52619df0360ab52e2c265c5a" -> "ffc9aabf32308c89aa3f2450ce15643f"
        id                 = "lambdas/demo/update_data.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_tags_function_object" {
      ~ etag               = "da34dfa8d313cea45c25e27c368ce6e7" -> "4f48bb997c66bb9a348b9f8a8e2b6916"
        id                 = "lambdas/demo/update_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag               = "b9f1aeb6e8a7524befa4ca2bc5c01963" -> "202f01334506c1f3f79d69694b0b5de2"
        id                 = "lambdas/demo/upload_file_s3_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag               = "51098d30771485c8ac65ee9710199fc6" -> "b5cd8a62b484a0a48d17d6f4ba5b66ce"
        id                 = "lambdas/demo/validate_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag               = "36e1b8285241d52c30b537d6ecfbf969" -> "77f203f05cf867df217281716b913fc9"
        id                 = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:26.000+0000" -> (known after apply)
      ~ source_code_hash               = "GpxlRW6erNNgGyVi7nHngR54P61qX3oNrOtoZ5L0nAk=" -> "TP4oENu6O6yhC+WCWm6hWbRQbHbzEO7o8BJ0q/kERRs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "ACaQ2iA/Uf9O8umY1avcleE/j/emfJcTMDNx5VWJT2I=" -> "MWAXaS56HZ0EhkQU6x/reppsAJbI/SbUY2ka6G0QWOQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_tag_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_tag_lambda_function" {
        id                             = "demo_add_tag_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "kM/yBDSuzXCA4kxMRxXQUBOS4X009ZvtgwuTmpBG6xg=" -> "dat7OyiYzLgAUrfQbIL9LN4iuZUrDt6cpjmxAiAi1h0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:27.000+0000" -> (known after apply)
      ~ source_code_hash               = "U7ZwrPsi1rDAzHH/5O4hGKHqKKXH9+iDO5B9KknOYTk=" -> "TC+/Q7jmUL1ckSGpSLneFVFlZM2Dkzw1N1mNj8hzH5M="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:29.000+0000" -> (known after apply)
      ~ source_code_hash               = "CTF/G0OKeMFi6U+8WfpQh+jRG+ciJf15ETWeOk+i7XA=" -> "IT9/NFJgicZBv12Oi621VPSJ/cNXjpoL0EB4RnmvsUY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:09.000+0000" -> (known after apply)
      ~ source_code_hash               = "LuTKy9xT3dHmtW8ZF+u0eceVZla/ioMqowgajaBOZYc=" -> "JaFCBEsEzmJSTW5E/2tthRg3ClWEkFAOHMTNWmD3Ybo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:36.000+0000" -> (known after apply)
      ~ source_code_hash               = "CKw6FT/s+ne8gXKu52AtntKlN9szJaZpZq3Tu6teU7U=" -> "TVP6otXoTi8utQfJ6cdYW3P3UnssT2/r6l5M8wJlXtI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2022-11-07T19:02:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "IaeTVM6O62ehj3qpc8L/9TSibB7sAXRkkgngq0nH4BU=" -> "N4fRo3siVHpxMWm5pBowANIwZUc73eyfOXeybstWeJI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2022-11-07T19:02:52.000+0000" -> (known after apply)
      ~ source_code_hash               = "aYXUc4ckpLYEsSZ5iWsdx3F7hXYUEntUYmw15po2fw8=" -> "qzVDchiiPFg8o1FzOVMUNI3u2lA1isjJ2tciXSXUrRA="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:26.000+0000" -> (known after apply)
      ~ source_code_hash               = "Oa/fr3Nqq6+j+F8ePTbZZygqnQ10xTRN11u7+oh8vbw=" -> "Nl9nqYlrNkbI3Hv5wH8WlTiZL5IWu3KUOya3EJLWMJI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2022-11-07T19:02:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "Irl/CJoO/LlAXowQ/E41y8RPjTthuAD6RWYynIWGi0U=" -> "ZMq0gcNGLrNuas2W5w5S9tfFO4MfJXmGtQFQlbPMTyk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_tags_lambda_function" {
        id                             = "demo_delete_tags_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:17.000+0000" -> (known after apply)
      ~ source_code_hash               = "fCj2EXa0Y2ZeUAm51ZOOmyF9Gue9DOsv6VLdrblfv5I=" -> "MxRsVmeKnbMeP9ttL94sZcySDY2SwVfj7eXV/YbJSN0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "MCCkz5HPRlTsspYOkEVrrXtH4iSbNvhkLkUDMkB4Uh4=" -> "HQ6rExCsYx046dsTwT0Ot//CccMmEiLxx6RUuGK5K+s="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-11-07T19:02:56.000+0000" -> (known after apply)
      ~ source_code_hash               = "uFLWVgTV6MV5YuJHMx7wndJ4nfplNKvXWB4Txeqwr8g=" -> "qsdzIEKCy4WDhK5MI4FVGlQJvRV7x/HSyDmhW47e1iM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "60SCU1tadnttLvhqxwWfj36SeXRmVVlVGHjvrWgEVFU=" -> "O5vojQcilaEBKnKXLQq1Kzz0bMJHBbmhf18Qu7zHpos="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2022-11-07T19:02:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "6A2A4xUnKzS4vq7bdnlcenIjr/v+/X/1ypyeZUkdOTA=" -> "6wRBqYQ84iLTAGabPlaym8jm4acT24cwl/itqH8OWm4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "CZCIVTWH6TU8VbMld8PT2K9tjUT68ddSrs93RIYq7c4=" -> "DeYW0OoMLf5Wu9dMcpbvdHmI0HG1VavMoeAokJTi/vg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_ranges_lambda_function" {
        id                             = "demo_get_all_ranges_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:04.000+0000" -> (known after apply)
      ~ source_code_hash               = "xqQvAZCNGviCNhhWQs+Ddt38xBftIGZNA7OQ9z7Spu0=" -> "POmC/1+kkC6PjVjCV8uxqSonBdxmbwx7wOYtZFU7dHY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_tags_lambda_function" {
        id                             = "demo_get_all_tags_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:21.000+0000" -> (known after apply)
      ~ source_code_hash               = "GwwEWm8Ax8qmSILT+YrlgoOWjLp9s66R847uc32X2wE=" -> "ObUuhCHGtZdfQyamcgJN7AiuSrp1d2wbOeI6sn939PY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "1AmHcMetcH9+3772BRRUgNSetfqmUH8LuqPY0iZOPl4=" -> "AFgOlwRrkcaNTO1utsGE7uYRLPXvKvI/YEMIISU1NaU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "znyrl9PGbiJ5nAJN6bd2OqbhaOCd7EZl86NNjDEKmRU=" -> "3k8G/dlFBpx4Xzo1Acg8GO3f+RXeFAArUqDdStQu3kI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2022-11-07T19:02:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "V5GVH+qta6CXJFbaTAJp0v6aLPGeGtfNlIjMeRAEnMU=" -> "ukPD1IgqibtVXvB6kCmvp3hneSifB8u8SMQnVon3sTY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:07.000+0000" -> (known after apply)
      ~ source_code_hash               = "q1+Nv5Wre9wCCPPQxjrNX3qFtOX6yM7EizCGfqRnAI0=" -> "lyqCaM56/m15u70HiGTGZ4hkUvg6nZxOR/6PxvU0eXg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:04.000+0000" -> (known after apply)
      ~ source_code_hash               = "vd0Jd0w1AVhuW7TFBYGs0m1Ws7tq3Q38uuaLFqK17js=" -> "pB25RWuH8k0diyvjB0eYDvv1ORcYRrrQKvUv0p0WZtU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:04.000+0000" -> (known after apply)
      ~ source_code_hash               = "Zj0cKzxRnr/DFc+npcDwx6UpMXq9PpdlUgAngWLk/0k=" -> "3FvqSJ6e9GgiE0sO40wPeTMkG3l0D+cp+WXXO0RNjBw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "5/Y3dOPVPatsRc0OdRBCoLAmHw3ZdXVNtQDRMhxNPVI=" -> "P7Kf5R5ZbM6wYmmxGW/owsWcRM3E5jLPKaSD5sSxdWs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-11-07T19:02:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "GLi186NY01em5Y/mAYTNV4mcrFNMCbZJ1qOt/2+gPQg=" -> "HVBV56ovRmJD07DEAvAhRIizxVe/vw4+lZ/11W18hGM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_date_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_date_report_lambda_function" {
        id                             = "demo_get_investment_date_report_lambda_function"
      ~ last_modified                  = "2022-11-07T19:02:57.000+0000" -> (known after apply)
      ~ source_code_hash               = "GbZ2EcJ7HmGxddiSvRHLSSisyf67066kyLC+aifDrD0=" -> "YM2Nc2HFaObtAtRtsJs7kJHzG0zPSjRXvADfn48EIOU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "iRVuFcYztVf3ijIh/8+RS0W+2cnmVd/I8ulm2jPMxyU=" -> "U1sQHgr/KUzLZqfC1yBT8e/9f2Bg0xevjex9bIvtoOs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_ranges_by_metric_lambda_function will be created
  + resource "aws_lambda_function" "get_ranges_by_metric_lambda_function" {
      + arn                            = (known after apply)
      + function_name                  = "demo_get_ranges_by_metric_lambda_function"
      + handler                        = "get_ranges_by_metric_handler.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = [
          + "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:22",
        ]
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.8"
      + s3_bucket                      = "kpinetwork-backend"
      + s3_key                         = "lambdas/demo/get_ranges_by_metric_handler.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "CuxxGbMgSERQM1JNNCT+n9xHR12mgAj74UkJQkLo2Pg="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 100
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "ACCESS_KEY"   = (sensitive)
              + "DB_HOST"      = (sensitive)
              + "DB_NAME"      = "demokpinetworkdb"
              + "DB_PASSWORD"  = (sensitive)
              + "DB_USERNAME"  = (sensitive)
              + "SECRET_KEY"   = (sensitive)
              + "USER_POOL_ID" = "us-west-2_usXw4S12D"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }

      + vpc_config {
          + security_group_ids = [
              + "sg-0bda66e4a9afc62a9",
            ]
          + subnet_ids         = [
              + "subnet-0264422b45299167e",
            ]
          + vpc_id             = (known after apply)
        }
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:18.000+0000" -> (known after apply)
      ~ source_code_hash               = "o45RpGVmhxjSgFRJou2gS6L+ipIvDlB1ANUvsOrPI7s=" -> "GvUMgpHF5zCjjvQlcFqhkeEvx9usc5FkNfX2OYOIxjU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_tags_by_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_tags_by_company_lambda_function" {
        id                             = "demo_get_tags_by_company_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "wKsQQRPpj2yPogI8vThZ6SqXuWAvGYdRGlGWv2xnRr8=" -> "Pr9oQTXzhMJCkCn9esdiTaPthAoSbDrBd6BWmzGHuNY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:26.000+0000" -> (known after apply)
      ~ source_code_hash               = "/s+gA83DnAgzhpVlu4LkeGnPlLGGH3skxQHB5lM2/Bo=" -> "vThC9qlYi3I5TGLxYovdyiGY/Pi9xVVRgnR5NGhhQcM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2022-11-07T19:02:57.000+0000" -> (known after apply)
      ~ source_code_hash               = "aCmtwKuv5CnUAm+fr6GLcJMLjsgOSlEIxT8xobMNAUw=" -> "hJDCnxp64Ij4TMVzDrp+haG6N0SuMJvbGwrpSxRMasc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2022-11-07T19:02:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "TSj12fp06ujnAgMB8VODrORirMe4Y/3Rvd6Bl2JWHRA=" -> "K9yVDS6KrOk2QniN9KhhZKyNykdt7sFDnl+7ELXWW4E="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:18.000+0000" -> (known after apply)
      ~ source_code_hash               = "6qPuauwQy7mEuk7rxNKGm5eQW1ysR0Gm426WhKOz39A=" -> "Qd56rb9cUmSbfp5kjb8WH4bkbzJMPPTI5IfHWrwSDFQ="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "jXL27f678LVKTCY/FkyGKjUjBayAK1S6bl+IKnuTNDg=" -> "r62ivYb05RiMWQbcAW97OlE+D/QncI9cN6jMHmerEoQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "YA2Ldttnk21v6NaYOaRVmi1cFZDL4lbF53v/XBLU9so=" -> "EzQbsRryhtsxRdGAGB7pQuY9/DKqOLZ8cgLeG5iwqZo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:02.000+0000" -> (known after apply)
      ~ source_code_hash               = "i6Y284eIOjf/kakPuxvPpL1nwqrry5qYnmapd1n5bBE=" -> "dCRCeqWbnIWw7B6bKATqBFKBa7tLAp+9ldsXkNVJcT0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_tags_lambda_function" {
        id                             = "demo_update_tags_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:19.000+0000" -> (known after apply)
      ~ source_code_hash               = "5LtDCYQPOLxqt8NWFiwNgST/pn/QTkvP2Tq05JgjDbw=" -> "dD1AyJuN0k4csZTQYcvFHAqblurktQemxh19zgSR4ak="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "6SN/Ks2wG39i4GWwAyvbWiKBUnGtQqPJLE+CPOxK35k=" -> "Iv5E/t5OrdswowARnf5jwLH6/cMLfVSAPTUutaGE3Lo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:24.000+0000" -> (known after apply)
      ~ source_code_hash               = "6xHUmuMOMZhQdH0w7uuc8X2cm8YJx3VWDT9J2rWIo7g=" -> "d2GMtZuG/H4p6j/G6lY5BdTgB3VqdewU+rlLiPVw65A="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:13.000+0000" -> (known after apply)
      ~ source_code_hash               = "4wCcTXyQzRDBLrwWFntfCy6ZYDplzV8bmGkLsuVLgaI=" -> "bLTZ4tBg1wPR3vS7yVH6OHaUdvGltjcGdgQsFUMzWgA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2022-11-07T19:02:51Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "99awu9" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2022-11-07T19:02:51Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.logs.aws_cloudwatch_log_group.get_ranges_by_metric_lambda_function will be created
  + resource "aws_cloudwatch_log_group" "get_ranges_by_metric_lambda_function" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/demo_get_ranges_by_metric_lambda_function"
      + retention_in_days = 14
      + tags_all          = (known after apply)
    }

  # module.network.aws_api_gateway_integration.get_ranges_by_metric_integration will be created
  + resource "aws_api_gateway_integration" "get_ranges_by_metric_integration" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = "kb7gblbu69"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.network.aws_api_gateway_method.get_ranges_by_metric_method will be created
  + resource "aws_api_gateway_method" "get_ranges_by_metric_method" {
      + api_key_required   = false
      + authorization      = "CUSTOM"
      + authorizer_id      = "3y14fs"
      + http_method        = "GET"
      + id                 = (known after apply)
      + request_parameters = {
          + "method.request.querystring.limit"  = false
          + "method.request.querystring.offset" = false
        }
      + resource_id        = (known after apply)
      + rest_api_id        = "kb7gblbu69"
    }

  # module.network.aws_api_gateway_resource.ranges_by_metric will be created
  + resource "aws_api_gateway_resource" "ranges_by_metric" {
      + id          = (known after apply)
      + parent_id   = "xqe34y"
      + path        = (known after apply)
      + path_part   = "{metric}"
      + rest_api_id = "kb7gblbu69"
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2022-11-07T19:02:50Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
                  - status       = "$context.status"
                  - user         = "$context.identity.user"
                }
            ) -> null
        }

        # (1 unchanged block hidden)
    }

  # module.policy.aws_iam_role.get_ranges_by_metric_lambda_exec_role will be created
  + resource "aws_iam_role" "get_ranges_by_metric_lambda_exec_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Allows Lambda Function to call AWS services on your behalf."
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "demo_get_ranges_by_metric_lambda_exec_role"
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.policy.aws_iam_role_policy.get_ranges_by_metric_cognito_policy will be created
  + resource "aws_iam_role_policy" "get_ranges_by_metric_cognito_policy" {
      + id     = (known after apply)
      + name   = "demo_get_ranges_by_metric_cognito_policy"
      + policy = (sensitive)
      + role   = (known after apply)
    }

  # module.policy.aws_iam_role_policy_attachment.get_ranges_by_metric_lambda_logs will be created
  + resource "aws_iam_role_policy_attachment" "get_ranges_by_metric_lambda_logs" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::435552912911:policy/iam_policy_lambda_logging_function"
      + role       = "demo_get_ranges_by_metric_lambda_exec_role"
    }

  # module.policy.aws_iam_role_policy_attachment.get_ranges_by_metric_lambda_vpc will be created
  + resource "aws_iam_role_policy_attachment" "get_ranges_by_metric_lambda_vpc" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::435552912911:policy/iam_policy_lambda_network_function"
      + role       = "demo_get_ranges_by_metric_lambda_exec_role"
    }

  # module.policy.aws_lambda_permission.apigw_get_ranges_by_metric_lambda will be created
  + resource "aws_lambda_permission" "apigw_get_ranges_by_metric_lambda" {
      + action        = "lambda:InvokeFunction"
      + function_name = "demo_get_ranges_by_metric_lambda_function"
      + id            = (known after apply)
      + principal     = "apigateway.amazonaws.com"
      + source_arn    = (sensitive)
      + statement_id  = "AllowExecutionFromAPIGateway"
    }

Plan: 12 to add, 87 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @kellycastrof, Action: `pull_request`*